IdeaRS.OpenModel.Connection.WeldData.WeldType
Type of the weld

IdeaRS.OpenModel.Connection.WeldData.ConnectedPartIds
Id of the weld

IdeaRS.OpenModel.Connection.WeldData.Start
Start of the weld

IdeaRS.OpenModel.Connection.WeldData.End
End of the weld